Repository: Ken-Andre/ngonnest
Catalog: code/flutter/ngonnest_app/lib/l10n/app_*.arb
Languages: fr

source: Dashboard
fr: Tableau de bord

source: Inventory
fr: Inventaire

source: Settings
fr: Paramètres

source: Language
fr: Langue

# notificationsEnabled
source: Enable notifications
fr: Activerles notifications

# notificationsDisabled
source: Disable notifications
fr: Désactiver les notifications

source: Theme
fr: Thème

source: Light mode
fr: Mode clair

source: Dark mode
fr: Mode sombre

source: System mode
fr: Mode système

source: Save
fr: Sauvegarder

source: Cancel
fr: Annuler

source: Error
fr: Erreur

source: Success
fr: Succès

# settingsSaved
source: Settings saved successfully
fr: Paramètres sauvegardés avec succès

# notificationPermissionDenied
source: Notification permission denied. You can enable it in system settings.
fr: Permission de notification refusée. Vous pouvez l'activerdans les paramètres système.

source: Open System Settings
fr: Ouvrir les paramètres système

source: Intelligent household management
fr: Gestion intelligente de votre foyer

# languageOfApp
source: Application language
fr: Langue de l'application

# choosePreferredLanguage
source: Choose your preferred language
fr: Choisissez votre langue préférée

# selectToChangeInterface
source: Select to change the interface
fr: Sélectionnez pour changer l'interface

source: Receive app alerts
fr: Recevoir des alertes sur l'app

source: Enable reminders for low stock
fr: Activer rappels pour stocks bas

source: Notification frequency
fr: Fréquence des notifications

source: Choose reminder frequency
fr: Choisissez la fréquence des rappels

source: Daily
fr: Quotidienne

source: Weekly
fr: Hebdomadaire

source: Privacy
fr: Confidentialité

source: Local data only
fr: Données locales uniquement

source: No sync without explicit consent
fr: Pas de sync sans accord explicite

source: Change app appearance
fr: Changer l'apparence de l'application

source: Send feedback
fr: Envoyer un feedback

source: Share your suggestions
fr: Partagez vossuggestions

source: Send
fr: Envoyer

source: Report bug
fr: Signaler un bug

# describeProblem
source: Describe the problem
fr: Décrivez le problème

source: Report
fr: Signaler

source: Data
fr: Données

source: Export data
fr: Exporter les données

source: Backup data locally
fr: Sauvegarder vos données localement

source: Export
fr: Exporter

source: Import data
fr: Importer des données

source: Restore from backup file
fr: Restaurer depuis un fichier sauvegardé

source: Import
fr: Importer

# cloudImportTitle
source: Cloud data found
fr: Données cloudtrouvées

# cloudImportMessage
source: We found existing data in your cloud account. What would you like to do?
fr: Nous avons trouvé des données existantes dans votre compte cloud. Que souhaitez-vous faire ?

# importOption
source: Import
fr: Importer

# importOptionDescription
source: Replace local data with cloud data
fr: Remplacer les données locales par les données cloud

# mergeOption
source: Merge
fr: Fusionner

# mergeOptionDescription
source: Combine local and cloud data
fr: Combiner les données locales et cloud

# skipOption
source: Skip
fr: Ignorer

# skipOptionDescription
source: Keep only local data
fr: Conserver uniquement les données locales

source: Import in progress...
fr: Import en cours...

source: Importing households...
fr: Importation des ménages...

source: Importing products...
fr: Importation des produits...

source: Importing budgets...
fr: Importation des budgets...

source: Importing purchases...
fr: Importation des achats...

# importSuccess
source: Import successful
fr: Import réussi

# importSuccessMessage
source: Your data has been imported successfully
fr: Vos données ont été importées avec succès

# importPartialSuccess
source: Import partially successful
fr: Import partiellement réussi

source: Import error
fr: Erreur d'importation

source: Retry
fr: Réessayer

# entitiesImported
source: {count} items imported
fr: {count} éléments importés

# householdsImported
source: {count} households
fr: {count} ménages

# productsImported
source: {count} products
fr: {count} produits

# purchasesImported
source: {count} purchases
fr: {count} achats

source: Delete all data
fr: Supprimer toutes les données

# completeResetIrreversible
source: Complete reset - Irreversible action
fr: Reset complet - Action irréversible

source: Delete
fr: Supprimer

source: Language changed successfully
fr: Langue modifiée avec succès

source: Error activating notifications
fr: Erreur lors de l'activation des notifications

source: Cloud Synchronization
fr: Synchronisation Cloud

# cloudSyncAllowsOnlineBackup
source: Cloud synchronization allows backing up your data online. Do you accept this functionality?
fr: La synchronisation cloud permet de sauvegarder vos données en ligne. Acceptez-vous cette fonctionnalité ?

# acceptCloudSync
source: I accept cloud synchronization
fr: J'accepte la synchronisation cloud

source: Accept
fr: Accepter

# syncEnabled
source: Synchronization enabled
fr: Synchronisation activée

# cloudSyncActivated
source: Cloud synchronization has been activated. Your data will be automatically backed up.
fr: La synchronisation cloud a été activée. Vos données seront automatiquement sauvegardées.

# sendFeedbackTitle
source: Send feedback
fr: Envoyer un feedback

# feedbackMessage
source: We would like to know your opinion about the application.
fr: Nous aimerions connaître votre avis sur l'application.

# typeMessageHere
source: Type your message here...
fr: Tapez votre message ici...

# reportBugTitle
source: Report bug
fr: Signaler un bug

# bugReportWillBeSent
source: Your report will be sent to our development team.
fr: Votre signalement sera envoyé à notre équipe de développement.

# continueContactTelegram
source: To continue contacting us, join our Telegram bot:
fr: Pour continuer à nous contacter, rejoignez notre bot Telegram :

source: Telegram link copied!
fr: Lien Telegram copié !

source: Feedback sent
fr: Feedback envoyé

# feedbackSentSuccessfully
source: Your feedback has been sent successfully.
fr: Votre feedback a été envoyé avec succès.

source: Bug report sent
fr: Signalement envoyé

# bugReportSentSuccessfully
source: Your bug report has been sent successfully.
fr: Votre signalement a été envoyé avec succès.

# deleteAllDataConfirmation
source: Delete all data?
fr: Supprimer toutes les données ?

# deleteAllDataWarning
source: This action will permanently delete all your inventory, budget and settings data. This action cannot be undone.
fr: Cette action supprimera définitivement toutes vos données d'inventaire, de budget et de paramètres. Cette action ne peut pas être annulée.

source: Data deleted
fr: Données supprimées

# allDataDeletedRestart
source: All your data has been deleted.\nThe application will restart.
fr: Toutes vos données ont été supprimées.\nL'application va redémarrer.

# exportDataConfirm
source: Export all your data to a JSON file?
fr: Exporter toutes vos données vers un fichier JSON ?

# exportSuccess
source: Data exported successfully
fr: Export effectué avec succès

# importDataConfirm
source: This operation will replace your current data. Continue?
fr: Cette opération remplacera vos données actuelles. Continuer ?

# storagePermissionRequired
source: Storage permission is required to export data
fr: L'autorisation de stockage est requise pour exporter les données

# storagePermissionDenied
source: Storage permission denied. Please grant access in system settings
fr: Autorisation de stockage refusée. Veuillez accorder l'accès dans les paramètres système

# storagePermissionPermanentlyDenied
source: Storage permission permanently denied. Please enable it in app settings
fr: Autorisation de stockage définitivement refusée. Veuillez l'activer dans les paramètres de l'application

source: Grant Storage Permission
fr: Accorder l'autorisation de stockage

source: Request timed out
fr: Requête expirée

# networkError
source: Network error. Please verify your internet connection.
fr: Erreur réseau. Veuillez vérifier votre connexion internet.

source: Welcome!
fr: Bienvenue !

source: Password
fr: Mot de passe

source: Confirm password
fr: Confirmer le mot de passe

source: Full name
fr: Nom complet

source: Sign in
fr: Se connecter

# signUp
source: Create account
fr: Créer un compte

source: Continue with Google
fr: Continuer avec Google

source: Continue with Apple
fr: Continuer avec Apple

source: Use your email
fr: Utiliser votre email

# alreadyHaveAccount
source: Already have an account? Sign in
fr: Déjà un compte? Se connecter

# noAccount
source: No account? Create account
fr: Pas de compte ? Créer un compte

source: Invalid email
fr: Email invalide

# passwordTooShort
source: Password too short (min 6 characters)
fr: Mot de passe trop court (min 8 caractères)

source: Passwords do not match
fr: Les mots de passe ne correspondent pas

# pleaseEnterFullName
source: Please enter your full name
fr: Veuillez saisir votre nom complet

# pleaseEnterFirstAndLastName
source: Please enter your first and last name
fr: Veuillez saisir votre prénom et nom

# pleaseEnterEmail
source: Please enter your email
fr: Veuillez saisir votre email

# pleaseEnterPassword
source: Please enter your password
fr: Veuillez saisir votre mot de passe

# pleaseConfirmPassword
source: Please confirm your password
fr: Veuillez confirmer votre mot de passe

source: Account created successfully!
fr: Compte créé avec succès !

source: Sign in successful!
fr: Connexion réussie !

source: Google sign in successful!
fr: Connexion Google réussie !

source: Apple sign in successful!
fr: Connexion Apple réussie !

# connectQuicklyWithExistingAccount
source: Connect quickly with your existing account
fr: Connectez-vous rapidement avec votre compte existant

source: or
fr: ou

source: Social networks
fr: Réseaux sociaux

# syncDataQuestion
source: Do you want to synchronize your data?
fr: Voulez-vous synchroniser vos données?

# syncDataExplanation
source: Cloud synchronization allows you to backup your data online and access it from all your devices.
fr: La synchronisation cloud permet de sauvegarder vos données en ligne et de les retrouver sur tous vos appareils.

source: Yes
fr: Oui

source: No, later
fr: Non, plus tard

# syncLaterMessage
source: You can enable synchronization later in settings
fr: Vous pouvez activer la synchronisation plus tard dansles paramètres

source: Synchronization
fr: Synchronisation

source: Sync status
fr: État de la synchronisation

# syncDisabled
source: Disabled
fr: Désactivée

# syncEnabledStatus
source: Enabled
fr: Activée

# syncUpToDate
source: ✓ Synchronized
fr: ✓ Synchronisé

# syncPending
source: ⏳ Pending ({count} operations)
fr: ⏳ En attente ({count} opérations)

# syncInProgress
source: 🔄 Synchronizing...
fr: 🔄 Synchronisation...

source: ⚠️ Sync error
fr: ⚠️ Erreur de sync

source: Last sync: {time}
fr: Dernière sync: {time}

# neverSynced
source: Never synchronized
fr: Jamais synchronisé

source: Tap for details
fr: Appuyez pour plus de détails

# connectToEnableSync
source: Connect to enable synchronization
fr: Connectez-vous pour activer la synchronisation

# syncStatusDetails
source: Synchronization details
fr: Détails de synchronisation

source: Pending operations
fr: Opérations en attente

source: Failed operations
fr: Opérations échouées

source: Sync history
fr: Historique de synchronisation

source: Enable cloud sync
fr: Activer la synchronisation cloud

source: Disable cloud sync
fr: Désactiver la synchronisation cloud

source: Keep local
fr: Conserver local

# keepLocalDescription
source: Upload local data to cloud
fr: Envoyer les donnéeslocales vers le cloud

source: Import from cloud
fr: Importer du cloud

# importFromCloudDescription
source: Download data from cloud
fr: Télécharger les données du cloud

# mergeData
source: Merge
fr: Fusionner

# mergeDataDescription
source: Combine local and cloud data
fr: Combiner les données locales et cloud

# syncSuccessMessage
source: Synchronization enabled successfully
fr: Synchronisation activée avec succès

# importOptionsTitle
source: Import options
fr: Options d'importation

# chooseImportOption
source: Choose how to handle your existing data
fr: Choisissez comment gérer vos données existantes
